[{"title":"Songs and Hymns of the Earliest Greek Christian Poets","hymnalID":"SHEG","number":"21","text":"O Thou, the King of saints, all-conquering Word,\n\r\nSon of the Highest, wisdom's Fount and Lord,\n\r\nThe prop that doth uphold through toil and pain;\n\r\nThe joy of ages through immortal reign;\n\r\nYet born of mortal flesh for life's brief span,\n\r\nO Saviour Jesus, Shepherd, Husbandman;\n\r\nHelm Thou to guide, and bridle to restrain,\n\r\nWing of the holy flock that heaven would gain;\n\r\nCatcher of men from evil's whelming sea,\n\r\nThe holy fishes, saved that are to be,\n\r\nDrawn from the billowy deep with sweetest lure\n\r\nOf life that shall for evermore endure:\n\r\nO holiest Shepherd of enlightened sheep,\n\r\nLead Thou Thy flock the upward heavenly steep:\n\r\nO King of holy children, lead the way,\n\r\nAnd pure may they both follow and obey!\n\r\nThou art, O Christ, the living heavenly Way,\n\r\nThe ever-flowing Word, unchanging Day,\n\r\nEternal Light, and mercy's healthful Spring;\n\r\nThe Perfecter of every virtuous thing;\n\r\nPure Life of all the happy ransomed throng\n\r\nWho hymn their God through all the ages long:\n\r\nThe heavenly milk, from holy breasts that flows,\n\r\nBy which the infant Church in wisdom grows,\n\r\nAnd graces rare, as it befits the Bride,\n\r\nAdorned, O Jesu Christ, for Thine own side.\n\r\nThy feeble children gather with sweet smile,\n\r\nTo sing with holy mouth, and free from guile,\n\r\nThyself, in songs and praises without end,\n\r\nThe children's leader, and the children's friend.\n\r\n\nO little children, thus so gently led,\n\r\nSo tenderly with truth and reason fed,\n\r\nAnd filled with the Holy Spirit's dew,\n\r\nOur hymns and praises feeble, yet all true,\n\r\n\nIn grateful homage unto Christ the King,\n\r\nWho taught us life, let us together sing:\n\r\nA peaceful choir, Christ-born, and undefiled,\n\r\nA people wise, sing we the strong-born child;\n\r\nSing we with heart and voice, and never cease\n\r\nTo praise with one accord the God of Peace!\n\r\n\n","doNotDisplay":"0","date":"1876","classifications":null}]