[{"title":"Songs and Hymns of the Earliest Greek Christian Poets","hymnalID":"SHEG","number":"13","text":"O Christ the King! since breath pent up so long\n\r\nI have outpoured, Thou first shalt be my song;\n\r\nMay this my word, the current of my mind,\n\r\nIf lawful thus to speak, acceptance find,\n\r\nAnd unto Thee as holy incense rise\n\r\nOf holiest priest, a grateful sacrifice!\n\r\nThe Father's Brightness, Word of the Great Mind,\n\r\nWho cannot be by power of speech defined,\n\r\nHigh Light of highest Light, the Only Son,\n\r\nImage and Seal of the Immortal One,     \n\r\nWithout beginning; from same Fount of Light\n\r\nWith the Great Spirit; infinite in might:\n\r\nAll-glorious Thou, and Author of all good:\n\r\nFrom age to age Thy truth hath firmly stood.\n\r\nEnthroned Thou reignest high in heaven above,\n\r\nAlmighty Breath of Mind and Lord of Love.\n\r\nThroughout this fram&#232;d universe Divine\n\r\nWhatever is, or shall be, all is Thine:\n\r\nThou madest all, to all Thou givest life,\n\r\nAnd all Thou guidest: nowhere fault or strife,\n\r\nNor error in Thy workmanship is found:\n\r\nThe whole in willing chain to Thee is bound.\n\r\nThou laid'st the world's foundation: and Thy nod\n\r\nAll things obey, and own their Sovereign God.\n\r\nFor Thee the lofty sun, the king of day,\n\r\nQuenching the stars, holds on his fiery way.\n\r\nFor Thee, for so Thou bidst, the eye of night,\n\r\nThe moon, waxes and wanes, full orb of light.\n\r\nFor Thee the belt of heaven, all-dancing ring,\n\r\nAnd seasons kindly mingling, laugh and sing.\n\r\nFor Thee the fix&#232;d stars and planets shine\n\r\nIn course, and speak Thy wisdom all divine.\n\r\nThy light they are, the heavenly minds that be,\n\r\nAll sing on high the glorious Trinity.\n\r\nMan is Thy glory too, angel below,\n\r\nHere placed to sing, O Light, Thy beauteous glow.\n\r\nImmortal, fleshless, glory's highest ray,\n\r\nWho mortal flesh yet took'st, man's woes to stay,\n\r\nFor Thee I live, for Thee my songs arise,\n\r\nFor Thee I am a breathing sacrifice;\n\r\nFor this, of all things once possessed by me,\n\r\nAlone remains, and this I give to Thee.\n\r\n\nI tie my tongue, and loose it at Thy will;\n\r\nIn either, what Thou wouldst may I fulfil,\n\r\nSpeak what is right, nor think aught else beside:\n\r\nFrom mire select the pearl, with Thee my Guide;\n\r\nGold from the sand, the rose from thorny brake,\n\r\nFrom straw-encumbered ears the pure grain take.\n\r\n\nTo Thee, O Christ, this wreath of uttered praise,\n\r\nAs firstfruits of my loving toil, I raise.\n\r\n\nFor from the dead, with whom He mingled lay,\n\r\nGreat Christ arose, upon this gladsome day;\n\r\nGates of grim Hades He did open fling;\n\r\nAnd broke death's power, and robbed him of his sting;\n\r\nRushed from the tomb, appeared to speaking men,\n\r\nFor whom, once born, He died and rose again;\n\r\nThat we new-born might rise, from death set free,\n\r\nAnd ever live, ascending Lord, with Thee.\n\r\nThis day glad Heaven with acclamation rings,\n\r\nAnd choir angelic crowning anthem sings.\n\r\nThis day my clos&#232;d lips I loose in song\n\r\nTo Thee, to whom my lute and breath belong.\n\r\n\nOf mind to Mind, of word to the true Word,\n\r\nI here have offered what I could afford:\n\r\nHereafter, if He will, I hope to bring\n\r\nTo the Great Spirit worthier offering.\n\r\n\n","doNotDisplay":"0","date":"1876","classifications":null}]