[{"title":"Hymns of Ter Steegen and Others (Second Series)","hymnalID":"HTS2","number":"113","text":"Oh what will be the day when won at last\n\r\nThe last long weary battle, we shall come\n\r\nTo those eternal gates the King hath passed,\n\r\nReturning from our exile to our Home;\n\r\nWhen earth’s last dust is washed from off our feet;\n\r\nThe last sweat from our brows is wiped away;\n\r\nThe hopes that made our pilgrim journey sweet\n\r\nAll met around us, realised that day!\n\r\n\nOh what will be the day, when we shall stand\n\r\nIrradiate with God’s eternal light;\n\r\nFirst tread as sinless saints the sinless land,\n\r\nNo shade nor stain upon our garments white;\n\r\nNo fear, no shame upon our faces then,\n\r\nNo mark of sin—oh joy beyond all thought!\n\r\nA son of God, a free-born citizen\n\r\nOf that bright city where the curse is not!\n\r\n\nOh what will be the day when with our prayer\n\r\nEternal singing shall be woven in—\n\r\nDeep sound of golden harps far echoing there\n\r\nTo praise the Lamb who took away our sin;\n\r\nWhen far and wide the radiant streets resound\n\r\nWith Hallelujah songs the ransomed sing,\n\r\nAnd clouds of sweetest incense rise around\n\r\nThe Throne where sits in light the Saviour King!\n\r\n\nOh what will be the day when we shall see\n\r\nThe Love that opened Heaven to ransomed men!\n\r\nLove draws us and we follow—we are free—\n\r\nNought severs us from our Belovèd then:\n\r\nThat veil of faith through which we looked of old\n\r\nHas passed away as mist before the sun;\n\r\nChrist throned in glory do our eyes behold,\n\r\nO’er worlds, through ages, reigning ever on.\n\r\n\nOh what will be the day when we shall hear\n\r\n“Come, oh ye blessed!” when we take our place\n\r\nBefore His throne in radiance sweet and clear,\n\r\nBehold His glorious, His belovèd Face—\n\r\nBehold the Eyes whence bitter tears have flowed\n\r\nFor all our grief, our hardness, and our sin—\n\r\nBehold the wounds whence streamed the precious Blood,\n\r\nWhich ransomed us, and washed us pure and clean!\n\r\n\nOh what will be the day when hand in hand,\n\r\nSaints wander through the pastures green and fair,\n\r\nThe trees of life upon the golden strand\n\r\nAs fresh as on the third day morn are there;\n\r\nThere all is new, and never shall be old,\n\r\nFor time is not, nor age, nor slow decay;\n\r\nNo dying eyes, no hearts grown strange and cold,\n\r\nAll pain, all death, all sighing fled away!\n\r\n\nOh what will be the day when every thought\n\r\nOf that dark valley we have left below,\n\r\nAnd all remembrance of the fight we fought,\n\r\nOur pilgrim journey, long and sad, and slow,\n\r\nShall only make the Glory brighter far,\n\r\nShall make the peace but deeper, sweeter yet?\n\r\nO’er that dark sea was Christ our Guiding Star,\n\r\nOur love were fainter love could we forget.\n\r\n\nOh what will be that day? no eye can see,\n\r\nNo ear can hear, no heart has yet conceived,\n\r\nWhat God shall give us, and what we shall be\n\r\nWhen we inherit what we have believed.\n\r\nO Land of Promise! rough may be the road,\n\r\nAnd long the race may be—but sweet the end;\n\r\nThe dead with Christ, the risen sons of God,\n\r\nWith Him we journey, and with Him ascend.\n\r\n","doNotDisplay":"0","date":"1899","classifications":null}]